aheadtest/4.12.14.20200820_none/fio_1Mwrite1.log
test: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=13062: Thu Nov  5 12:46:14 2020
  write: IOPS=95, BW=95.7MiB/s (100MB/s)(56.1GiB/600003msec)
    clat (usec): min=10315, max=34003, avg=10422.63, stdev=167.67
     lat (usec): min=10329, max=34022, avg=10441.97, stdev=167.97
    clat percentiles (usec):
     |  1.00th=[10290],  5.00th=[10290], 10.00th=[10421], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10421], 90.00th=[10421], 95.00th=[10552],
     | 99.00th=[10552], 99.50th=[10683], 99.90th=[13042], 99.95th=[13960],
     | 99.99th=[15008]
   bw (  KiB/s): min=92160, max=98304, per=99.99%, avg=97996.48, stdev=737.00, samples=1200
   iops        : min=   90, max=   96, avg=95.65, stdev= 0.76, samples=1200
  lat (msec)   : 20=100.00%, 50=0.01%
  cpu          : usr=0.30%, sys=4.73%, ctx=5971835, majf=0, minf=4470
  IO depths    : 1=100.8%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,57428,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=95.7MiB/s (100MB/s), 95.7MiB/s-95.7MiB/s (100MB/s-100MB/s), io=56.1GiB (60.2GB), run=600003-600003msec