aheadtest/4.12.14.20200820_none/fio_4Krandread1.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=12437: Thu Nov  5 11:43:52 2020
   read: IOPS=7103, BW=27.7MiB/s (29.1MB/s)(16.3GiB/600001msec)
    clat (usec): min=111, max=206326, avg=133.49, stdev=244.43
     lat (usec): min=112, max=206327, avg=134.88, stdev=244.43
    clat percentiles (usec):
     |  1.00th=[  120],  5.00th=[  124], 10.00th=[  126], 20.00th=[  127],
     | 30.00th=[  129], 40.00th=[  130], 50.00th=[  133], 60.00th=[  135],
     | 70.00th=[  137], 80.00th=[  139], 90.00th=[  143], 95.00th=[  147],
     | 99.00th=[  155], 99.50th=[  161], 99.90th=[  180], 99.95th=[  210],
     | 99.99th=[  519]
   bw (  KiB/s): min=16760, max=29872, per=99.99%, avg=28408.70, stdev=791.25, samples=1199
   iops        : min= 4190, max= 7468, avg=7102.14, stdev=197.81, samples=1199
  lat (usec)   : 250=99.97%, 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 250=0.01%
  cpu          : usr=3.83%, sys=21.29%, ctx=4657331, majf=0, minf=31188
  IO depths    : 1=100.9%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4261889,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=27.7MiB/s (29.1MB/s), 27.7MiB/s-27.7MiB/s (29.1MB/s-29.1MB/s), io=16.3GiB (17.5GB), run=600001-600001msec