aheadtest/4.12.14.20200820_none/fio_4Krandread32.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.7
Starting 32 processes

test: (groupid=0, jobs=32): err= 0: pid=12646: Thu Nov  5 11:53:59 2020
   read: IOPS=28.5k, BW=111MiB/s (117MB/s)(65.3GiB/600002msec)
    clat (usec): min=136, max=213121, avg=1114.24, stdev=313.66
     lat (usec): min=137, max=213122, avg=1115.68, stdev=313.66
    clat percentiles (usec):
     |  1.00th=[ 1004],  5.00th=[ 1057], 10.00th=[ 1074], 20.00th=[ 1090],
     | 30.00th=[ 1106], 40.00th=[ 1106], 50.00th=[ 1106], 60.00th=[ 1123],
     | 70.00th=[ 1123], 80.00th=[ 1123], 90.00th=[ 1139], 95.00th=[ 1156],
     | 99.00th=[ 1319], 99.50th=[ 1434], 99.90th=[ 1745], 99.95th=[ 1893],
     | 99.99th=[ 2212]
   bw (  KiB/s): min= 2040, max= 3648, per=3.12%, avg=3565.25, stdev=46.34, samples=38386
   iops        : min=  510, max=  912, avg=891.31, stdev=11.59, samples=38386
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.68%
  lat (msec)   : 2=99.29%, 4=0.03%, 10=0.01%, 20=0.01%, 250=0.01%
  cpu          : usr=0.51%, sys=3.00%, ctx=20623736, majf=0, minf=12873
  IO depths    : 1=100.8%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=17115313,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=111MiB/s (117MB/s), 111MiB/s-111MiB/s (117MB/s-117MB/s), io=65.3GiB (70.1GB), run=600002-600002msec