aheadtest/4.12.14.20200820_none/fio_4Kread1.log
test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=12954: Thu Nov  5 12:14:13 2020
   read: IOPS=7606, BW=29.7MiB/s (31.2MB/s)(17.4GiB/600001msec)
    clat (usec): min=109, max=205784, avg=125.26, stdev=192.51
     lat (usec): min=110, max=205786, avg=126.59, stdev=192.51
    clat percentiles (usec):
     |  1.00th=[  112],  5.00th=[  118], 10.00th=[  119], 20.00th=[  120],
     | 30.00th=[  122], 40.00th=[  124], 50.00th=[  125], 60.00th=[  126],
     | 70.00th=[  128], 80.00th=[  130], 90.00th=[  133], 95.00th=[  135],
     | 99.00th=[  147], 99.50th=[  151], 99.90th=[  184], 99.95th=[  204],
     | 99.99th=[  379]
   bw (  KiB/s): min=18144, max=31304, per=99.99%, avg=30422.99, stdev=781.98, samples=1199
   iops        : min= 4536, max= 7826, avg=7605.72, stdev=195.49, samples=1199
  lat (usec)   : 250=99.98%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%, 20=0.01%, 250=0.01%
  cpu          : usr=2.75%, sys=19.50%, ctx=4965261, majf=0, minf=297
  IO depths    : 1=100.8%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4564008,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=29.7MiB/s (31.2MB/s), 29.7MiB/s-29.7MiB/s (31.2MB/s-31.2MB/s), io=17.4GiB (18.7GB), run=600001-600001msec