aheadtest/4.12.14.20200820_none/fio_4Kwrite1.log
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=13029: Thu Nov  5 12:36:07 2020
  write: IOPS=5002, BW=19.5MiB/s (20.5MB/s)(11.4GiB/600001msec)
    clat (usec): min=146, max=8961, avg=193.84, stdev=39.86
     lat (usec): min=148, max=8962, avg=195.12, stdev=39.86
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  165], 10.00th=[  167], 20.00th=[  172],
     | 30.00th=[  176], 40.00th=[  178], 50.00th=[  182], 60.00th=[  186],
     | 70.00th=[  200], 80.00th=[  219], 90.00th=[  235], 95.00th=[  265],
     | 99.00th=[  277], 99.50th=[  285], 99.90th=[  322], 99.95th=[  334],
     | 99.99th=[  807]
   bw (  KiB/s): min=19440, max=20336, per=99.99%, avg=20006.53, stdev=121.98, samples=1199
   iops        : min= 4860, max= 5084, avg=5001.61, stdev=30.49, samples=1199
  lat (usec)   : 250=91.78%, 500=8.20%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.75%, sys=12.13%, ctx=3001422, majf=0, minf=345
  IO depths    : 1=100.8%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3001338,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=19.5MiB/s (20.5MB/s), 19.5MiB/s-19.5MiB/s (20.5MB/s-20.5MB/s), io=11.4GiB (12.3GB), run=600001-600001msec